import os

from dotenv import load_dotenv

load_dotenv()


BOT_TOKEN = os.getenv('BOT_TOKEN')
TOKEN_API = os.getenv('TOKEN_API')
YOUR_API_KEY = os.getenv('YOUR_API_KEY')


DICT_CURRENCY = {'AED': "Дирхам ОАЭ", 'ARS': "Аргентинское пе́со", 'AUD': "Австралийский доллар",
                 'AMD': "Армянский драм", 'AZN': " Азербайджанский манат", 'BGN': "Болгарский лев",
                 'BRL': "Бразильский реал", 'BYN': "Белорусский рубль", 'CAD': "Канадский доллар",
                 'CHF': "Швейцарский франк", 'CNY': "Китайский юань", 'COP': "Колумбийское песо",
                 'CUP': "Кубинское песо", 'CZK': "Чешская крона", 'DKK': "Датская крона",
                 'EGP': "Египетский фунт", 'EUR': "Евро", 'GBP': "Фунт стерлинг", 'GEL': "Грузинский лари",
                 'HKD': "Гонконгский доллар", 'HUF': "Венгерский форинт", 'ILS': "шекель", 'INR': "Индийская рупия",
                 'JPY': "Японская иена", 'KGS': "Киргизский сом", 'KRW': "Южнокорейская вона",
                 'KZT': "Казахстанский тенге", 'MDL': "Молдавский лей ", 'MXN': "Мексиканское песо",
                 'NOK': "Норвежская крона", 'PLN': "Польский злотый", 'RON': "Румынский лей", 'RSD': "Сербский динар",
                 'RUB': "Российский рубль", 'SAR': "Саудовский риял", 'SEK': "Шведская крона",
                 'SGD': "Сингапурский доллар", 'THB': "Таиландский бат", 'TJS': "Таджикский сомони",
                 'TMT': "Новый туркменский манат", 'TRY': "Турецкая лира", 'UAH': "Украинская гривна",
                 'USD': "Американский доллар", 'UZS': "Узбекский су", 'VND': "Вьетнамский донг"}
